package add.larionov.poshlina

data class NamePoshlina (
    //список первый экран
    val poshlinaText1: String = "Подача искового заявления",
    val poshlinaText2: String = "Подача заявления о вынесении судебного приказа",
    val poshlinaText3: String = "Подача искового заявления о разделе имущества, находящегося " +
            "в общей собственности",
    val poshlinaText4: String = "Подача искового заявления о выделе доли из имущества, " +
            "находящегося в общей собственности",
    val poshlinaText5: String = "Подача искового заявления о признании права на долю в имуществе" +
            ", находящемся в общей собственности",
    val poshlinaText6: String = "Подача искового заявления по спорам, возникающим при заключении" +
            ", изменении или расторжении договоров, не содержащего требования" +
            " о возврате исполненного по сделке или о присуждении имущества",
    val poshlinaText7: String = "Подача искового заявления по спорам о признании сделок " +
            "недействительными, не содержащего требования о применении последствий " +
            "недействительности сделок",
    val poshlinaText8: String = "Подача искового заявления, содержащего требования об обращении " +
            "взыскания на заложенное имущество",
    val poshlinaText9: String =  "Подача искового заявления, содержащего требования об обращении" +
            " взыскания на заложенное имущество и денежное требование по солидарному " +
            "обязательству, по которому уплачена государственная пошлина, установленная для " +
            "исковых заявлений имущественного характера",
    val poshlinaText10: String = "Подача искового заявления об истребовании наследниками " +
            "принадлежащей им доли имущества при условии, что спор о признании права " +
            "собственности на это имущество судом ранее был разрешен",
    val poshlinaText11: String = "Подача искового заявления, содержащего требования о применении" +
            " последствий недействительности сделок",
    val poshlinaText12: String = "Подача искового заявления о расторжении брака",
    val poshlinaText13: String = "Подача заявления по делам особого производства",
    val poshlinaText14: String = "Подача заявления об оспаривании (полностью или частично) " +
            "нормативных правовых актов органов государственной власти, органов местного " +
            "самоуправления или должностных лиц",
    val poshlinaText15: String = "Подача административного искового заявления о признании " +
            "ненормативного правового акта недействительным и о признании решений и действий " +
            "(бездействия) государственных органов, органов местного самоуправления, иных органов" +
            ", должностных лиц",
    val poshlinaText16: String = "Подача заявления о правопреемстве, кроме случаев универсального " +
            "правопреемства",
    val poshlinaText17: String = "Подача заявления о выдаче исполнительных листов на " +
            "принудительное исполнение решений третейского суда, заявлений о признании и об " +
            "исполнении решения иностранного суда, иностранных третейских судов (арбитражей)",
    val poshlinaText18: String = "Подача заявления об отмене решения третейского суда",
    val poshlinaText19: String = "Подача заявления о выдаче дубликата исполнительного листа",
    val poshlinaText20: String = "Подача заявления о пересмотре заочного решения судом, вынесшим" +
            " это решение",
    val poshlinaText21: String = "Подача заявления о восстановлении пропущенного срока для " +
            "предъявления исполнительного листа к исполнению, об отсрочке или рассрочке " +
            "исполнения судебного постановления, изменении способа и порядка его исполнения, о " +
            "повороте исполнения судебного постановления, о разъяснении судебного постановления",
    val poshlinaText22: String = "Подача заявления о пересмотре судебных постановлений по новым " +
            "или вновь открывшимся обстоятельствам",
    val poshlinaText23: String = "Подача заявления об обеспечении иска, в том числе иска, " +
            "рассматриваемого в третейском суде, о замене обеспечительной меры, об отмене" +
            " обеспечения (за исключением заявлений о принятии предварительных обеспечительных" +
            " мер защиты авторских и (или) смежных прав в информационно-\nтелекоммуникационных" +
            " сетях, в том числе в сети \"Интернет\")",
    val poshlinaText24: String = "Подача заявления по делам о взыскании алиментов",
    val poshlinaText25: String = "Подача административного искового заявления о присуждении " +
            "компенсации за нарушение права на судопроизводство в разумный срок или права на " +
            "исполнение судебного акта в разумный срок",
    val poshlinaText26: String = "Подача административного искового заявления о присуждении " +
            "компенсации за нарушение условий содержания под стражей, содержания в " +
            "исправительном учреждении",
    val poshlinaText27: String = "Подача апелляционной жалобы",
    val poshlinaText28: String = "Подача частной жалобы",
    val poshlinaText29: String = "Подача кассационной жалобы на судебный приказ",
    val poshlinaText30: String = "Подача кассационной жалобы",

    //список 1

    val poshlinaText1_1: String = "Имущественного характера, не подлежащего оценке, а также " +
            "неимущественного характера",
    val poshlinaText1_2: String = "Имущественного характера, подлежащего оценке",

    //список 2

    val poshlinaText2_1: String = "Имущественного характера, не подлежащего оценке",
    val poshlinaText2_2: String = "Имущественного характера, подлежащего оценке",

    //список 3

    val poshlinaText3_1: String = "Если спор о признании права собственности истца (истцов) на это " +
            "имущество ранее не решался судом",
    val poshlinaText3_2: String = "Если ранее суд вынес решение о признании права собственности " +
            "истца (истцов) на указанное имущество",

    //список 4

    val poshlinaText4_1: String = "Если спор о признании права собственности истца (истцов)" +
            " на это имущество ранее не решался судом",
    val poshlinaText4_2: String = "Если ранее суд вынес решение о признании права собственности " +
            "истца (истцов) на указанное имущество",

    //список 5

    val poshlinaText5_1: String = "Если спор о признании права собственности истца (истцов) " +
            "на это имущество ранее не решался судом",
    val poshlinaText5_2: String = "Если ранее суд вынес решение о признании права собственности " +
            "истца (истцов) на указанное имущество",



    //список юр физ лицо

    val poshlinaTextFiz: String = "Физическое лицо",
    val poshlinaTextUr: String = "Юридическое лицо",
)
